tweeting-policy/tweeting-policy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-27 sáb 20:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Policy for Twitter</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bruno Miguel" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Rubik:ital,wght@0,400;0,500;0,600;0,700;1,300;1,400;1,500;1,600;1,700&display=swap" rel="stylesheet"> 
</head>
<body>
<div id="content">
<h1 class="title">Policy for Twitter</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#tweeting-policyframework">1. Policy for Twitter</a>
<ul>
<li><a href="#rules-for-communicating-on-twitter">1.1. Rules for communicating on Twitter</a>
<ul>
<li><a href="#the-dos">1.1.1. The do's</a></li>
<li><a href="#the-donts">1.1.2. The don'ts</a></li>
<li><a href="#tone">1.1.3. Tone</a></li>
</ul>
</li>
<li><a href="#who-should-have-access-to-the-twitter-accounts">1.2. Who should have access to the Twitter accounts</a></li>
<li><a href="#examples-of-tweets">1.3. Examples of tweets</a>
<ul>
<li><a href="#issues-with-the-service">1.3.1. Issues with the service</a></li>
</ul>
</li>
<li><a href="#tweeting-about-tenants">1.4. Tweeting about tenants</a>
<ul>
<li><a href="#example-of-tweets">1.4.1. Example of tweets</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-tweeting-policyframework" class="outline-2">
<h2 id="tweeting-policyframework"><span class="section-number-2">1</span> Policy for Twitter</h2>
<div class="outline-text-2" id="text-tweeting-policyframework">
<p>
At Twitter, we have two official accounts: <a href="https://twitter.com/fosshostorg">@fosshostorg</a> and <a href="https://twitter.com/aarch64org">@aarch64org</a>. We're on this social network to let people know what we're doing as a project, and also - but not limited - to:
</p>

<ul class="org-ul">
<li>interact with other accounts to raise awareness, on the media or other communities, about our projects;</li>
<li>allow the outside world to contact us;</li>
<li>answer questions that don't need to be answered in different communication channels (ex: how do I apply?);</li>
<li>announce issues with the services that fulfil the requirements needed to be tweeted.</li>
</ul>

<p>
Both accounts should reflect our core values and principles, and be warm and welcoming, as it is part of our identity in the quest to help the entire FOSS community.
</p>

<p>
We are a project run by people who volunteer their free time to help Fosshost and the FOSS community. This should also be reflected in the way we communicate on Twitter. Keep in mind that when you post a message, big or small, you are representing Fosshost to a global audience, and you need to respect it all the time.
</p>
</div>

<div id="outline-container-rules-for-communicating-on-twitter" class="outline-3">
<h3 id="rules-for-communicating-on-twitter"><span class="section-number-3">1.1</span> Rules for communicating on Twitter</h3>
<div class="outline-text-3" id="text-rules-for-communicating-on-twitter">
</div>
<div id="outline-container-the-dos" class="outline-4">
<h4 id="the-dos"><span class="section-number-4">1.1.1</span> The do's</h4>
<div class="outline-text-4" id="text-the-dos">
<ul class="org-ul">
<li>Be friendly and welcoming;</li>
<li>Treat others with respect;</li>
<li>Positively amplify our work and contributions;</li>
<li>Positively amplify the work and contributions of our tenants;</li>
<li>Promote a positive, fun, and productive discourse and presence online;</li>
<li>Ask the team for advice if you're not comfortable or confident posting something;</li>
<li>Amplify the voice of community members, users and contributors alike if it's related to FOSS.</li>
</ul>
</div>
</div>

<div id="outline-container-the-donts" class="outline-4">
<h4 id="the-donts"><span class="section-number-4">1.1.2</span> The don'ts</h4>
<div class="outline-text-4" id="text-the-donts">
<ul class="org-ul">
<li>Don't feed the trolls;</li>
<li>Don't be rude;</li>
<li>Don't insult;</li>
<li>Don't argue;</li>
<li>Avoid bashing brands, companies, individuals, or other projects;</li>
<li>Respond to mentions on Twitter promptly (whenever possible) with quality engagement;</li>
<li>Avoid speculation;</li>
<li>Don't share any personal/confidential information, including any information shared with you in confidence or within private channels;</li>
<li>Don't post anything on social media you wouldn't want to see reported on news sites.</li>
</ul>
</div>
</div>

<div id="outline-container-tone" class="outline-4">
<h4 id="tone"><span class="section-number-4">1.1.3</span> Tone</h4>
<div class="outline-text-4" id="text-tone">
<p>
Our tone should be friendly, positive, fun, authentic, aspirational and slightly tongue-in-cheek.
</p>

<p>
A volunteer tweeting can also add a bit of their identity to a tweet, so it doesn't stray from our rules. For example, we don't want someone sending the application's link with a rolling eyes emoji.
</p>
</div>
</div>
</div>

<div id="outline-container-who-should-have-access-to-the-twitter-accounts" class="outline-3">
<h3 id="who-should-have-access-to-the-twitter-accounts"><span class="section-number-3">1.2</span> Who should have access to the Twitter accounts</h3>
<div class="outline-text-3" id="text-who-should-have-access-to-the-twitter-accounts">
<p>
Access to the Twitter account should be as restrictive as possible so that possible issues are minimized. That said, four types of internal roles should always have access:
</p>
<ul class="org-ul">
<li>Directors;</li>
<li>Executive Officers (CEO, COO, CTO and deputies);</li>
<li>Head of marketing;</li>
<li>Communication team</li>
</ul>
</div>
</div>

<div id="outline-container-examples-of-tweets" class="outline-3">
<h3 id="examples-of-tweets"><span class="section-number-3">1.3</span> Examples of tweets</h3>
<div class="outline-text-3" id="text-examples-of-tweets">
</div>
<div id="outline-container-issues-with-the-service" class="outline-4">
<h4 id="issues-with-the-service"><span class="section-number-4">1.3.1</span> Issues with the service</h4>
<div class="outline-text-4" id="text-issues-with-the-service">
<p>
Assume we have a node down due to a hardware failure, and the company where the node is hosted gives an ETA of one hour. The tweet can be like the following example:
</p>

<blockquote>
<p>
Our x86 NQTHV0 node is down due to a hard drive failure. We're working as fast as possible to get it fixed and hope to have the node back up in 1h. We apologize for any inconvenience this may cause you.
</p>
</blockquote>

<p>
Now assume we have connectivity issues and no ETA:
</p>

<blockquote>
<p>
Our x86 NQTHV0 is experiencing connectivity issues. We're on it and will have it fixed as fast as possible. Apologies for the inconvenience this is causing you.
</p>
</blockquote>

<p>
We could also have a scheduled maintenance:
</p>

<blockquote>
<p>
On the 10th of December, at 10AM PST, our NQTHV0 will undergo maintenance. We anticipate 30 minutes of downtime.
</p>
</blockquote>

<p>
If the downtime was longer than previously anticipated for the maintenance:
</p>

<blockquote>
<p>
Sorry, folks, the maintenance is taking a little bit longer than anticipated. Rest assured, we are working hard to conclude it as quickly as possible.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-tweeting-about-tenants" class="outline-3">
<h3 id="tweeting-about-tenants"><span class="section-number-3">1.4</span> Tweeting about tenants</h3>
<div class="outline-text-3" id="text-tweeting-about-tenants">
<p>
From time to time, we should shout out to a tenant of ours, no matter the size of the project. We could - and should - even congratulate a tenant for a new release or a new achievement.
</p>

<p>
Doing so help us by showing we recognize and appreciate our tenants, and it also helps us build a good relationship with them.
</p>
</div>

<div id="outline-container-example-of-tweets" class="outline-4">
<h4 id="example-of-tweets"><span class="section-number-4">1.4.1</span> Example of tweets</h4>
<div class="outline-text-4" id="text-example-of-tweets">
<p>
Suppose a tenant releases a new version:
</p>

<blockquote>
<p>
Congratulations on the new release, @ubuntu_unity
</p>
</blockquote>

<blockquote>
<p>
Another solid release by @garudalinux
</p>
</blockquote>

<p>
Or suppose a tenant gets an important milestone:
</p>

<blockquote>
<p>
Keep up the good work, @SerpentOS
</p>
</blockquote>

<p>
/Policy partially inspired on
<a href="https://github.com/bsdlabs/community/blob/main/guidelines.md">BSDLabs
guidelines</a> and
<a href="https://www.apache.org/foundation/marks/socialmedia">Apache
guidelines</a>/
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bruno Miguel</p>
<p class="date">Created: 2021-11-27 sáb 20:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
